RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_spdif.c
    /* Handle Q channel full flag */
    if (((SPDIF_GetStatusFlag(base) & (uint32_t)kSPDIF_QChannelReceiveRegisterFull) != 0x00U) &&
        ((base->SIE & (uint32_t)kSPDIF_QChannelReceiveRegisterFull) != 0x00U))
    {
        buffer = handle->spdifQueue[handle->queueDriver].qdata;
        if (buffer != NULL)
        {
            data      = SPDIF_ReadQChannel(base);
            buffer[0] = (uint8_t)data & 0xFFU;
            buffer[1] = (uint8_t)(data >> 8U) & 0xFFU;
            buffer[2] = (uint8_t)(data >> 16U) & 0xFFU;
        }
    }

    /* Handle U channel full flag */
    if (((SPDIF_GetStatusFlag(base) & (uint32_t)kSPDIF_UChannelReceiveRegisterFull) != 0x00U) &&
        ((base->SIE & (uint32_t)kSPDIF_UChannelReceiveRegisterFull) != 0x00U))
    {
        buffer = handle->spdifQueue[handle->queueDriver].udata;
        if (buffer != NULL)
        {
            data      = SPDIF_ReadUChannel(base);
            buffer[0] = (uint8_t)data & 0xFFU;
            buffer[1] = (uint8_t)(data >> 8U) & 0xFFU;
            buffer[2] = (uint8_t)(data >> 16U) & 0xFFU;
        }
    }

    /* Handle audio data transfer */
    if (((SPDIF_GetStatusFlag(base) & (uint32_t)kSPDIF_RxFIFOFull) != 0x00U) &&
        ((base->SIE & (uint32_t)kSPDIF_RxFIFOFull) != 0x00U))
    {
        dataSize = handle->watermark;
        buffer   = handle->spdifQueue[handle->queueDriver].data;
        while (i < dataSize)
        {
            /* Read left channel data */
            data = SPDIF_ReadLeftData(base);
            for (j = 0; j < 3U; j++)
            {
                *buffer = (uint8_t)((data >> (j * 8U)) & 0xFFU);
                buffer++;
            }

            /* Read right channel data */
            data = SPDIF_ReadRightData(base);
            for (j = 0; j < 3U; j++)
            {
                *buffer = (uint8_t)((data >> (j * 8U)) & 0xFFU);
                buffer++;
            }

            i++;
        }
        handle->spdifQueue[handle->queueDriver].dataSize -= (uint32_t)dataSize * 6U;
        handle->spdifQueue[handle->queueDriver].data += dataSize * 6U;

        /* If finished a block, call the callback function */
        if (handle->spdifQueue[handle->queueDriver].dataSize == 0x00U)
        {
            (void)memset(&handle->spdifQueue[handle->queueDriver], 0, sizeof(spdif_transfer_t));
            handle->queueDriver = (handle->queueDriver + 0x01U) % SPDIF_XFER_QUEUE_SIZE;
            if (handle->callback != NULL)
            {
                (handle->callback)(base, handle, kStatus_SPDIF_RxIdle, handle->userData);
            }
        }

        /* If all data finished, just stop the transfer */
        if (handle->spdifQueue[handle->queueDriver].data == NULL)
        {
            SPDIF_TransferAbortReceive(base, handle);
        }
    }
}

#if defined(SPDIF)
void SPDIF_DriverIRQHandler(void);
void SPDIF_DriverIRQHandler(void)
{
    if ((s_spdifHandle[0][0] != NULL) && (s_spdifTxIsr != NULL))
    {
        s_spdifTxIsr(SPDIF, s_spdifHandle[0][0]);
    }

    if ((s_spdifHandle[0][1] != NULL) && (s_spdifRxIsr != NULL))
    {
        s_spdifRxIsr(SPDIF, s_spdifHandle[0][1]);
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif
